#+TITLE: Bluetooth Low Energy Connected Device

This provides a command-line interface and web-server for bluepy. I created it to help me learn about Bluetooth Low Energy.

*** Install bluepy

First setup and build it.

#+BEGIN_EXAMPLE
cd bluepy/
python setup.py build
sudo python setup.py install
#+END_EXAMPLE

This will build the helper and then install it with the code. The default helper doesn't have permission to connect to bluetooth so I like to change the permissions on it so that I don't have to run the python code as root.

First change into the folder where bluepy was installed (in this case I'll assume it's in a virtualenv named ble_central).

#+BEGIN_EXAMPLE
cd ~/.virtualenvs/ble_central/lib/python3.5/site-packages/bluepy
#+END_EXAMPLE

Now change the permissions so it can be run without being root.

#+BEGIN_EXAMPLE
sudo setcap 'cap_net_raw,cap_net_admin+eip' bluepy-helper
#+END_EXAMPLE

You can test it by running =blescan=.

#+BEGIN_SRC bash
blescan
#+END_SRC

#+RESULTS:
Scanning for devices...
    Device (new): b0:91:22:f6:c8:04 (public), -51 dBm 
        Flags: <05>
        Incomplete 16b Services: <80aa>
        Complete Local Name: 'CC2650 SensorTag'
        Tx Power: <00>
        0x12: <08002003>
        Manufacturer: <0d00030000>

Note that if you don't have any Bluetooth Low Energy devices nearby this won't return anything. If you see this:

#+BEGIN_EXAMPLE
Scanning for devices...
Traceback (most recent call last):
  File "/home/hades/.virtualenvs/ble_central/bin/blescan", line 11, in <module>
    load_entry_point('bluepy==1.1.1', 'console_scripts', 'blescan')()
  File "/home/hades/.virtualenvs/ble_central/lib/python3.5/site-packages/bluepy/blescan.py", line 122, in main
    devices = scanner.scan(arg.timeout)
  File "/home/hades/.virtualenvs/ble_central/lib/python3.5/site-packages/bluepy/btle.py", line 674, in scan
    self.start()
  File "/home/hades/.virtualenvs/ble_central/lib/python3.5/site-packages/bluepy/btle.py", line 612, in start
    self._mgmtCmd("le on")
  File "/home/hades/.virtualenvs/ble_central/lib/python3.5/site-packages/bluepy/btle.py", line 276, in _mgmtCmd
    "Failed to execute mgmt cmd '%s'" % (cmd))
bluepy.btle.BTLEException: Failed to execute mgmt cmd 'le on'
#+END_EXAMPLE

Then something went wrong with setting the permissions. Try it again or run blescan as root.


